In [9]:
import pandas as pd
import numpy as np

## 1. Show Pandas Version

In [5]:
pd.__version__

'1.1.1'

In [6]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : f2ca0a2665b2d169c97de87b8e778dbed86aea07
python           : 3.8.3.final.0
python-bits      : 64
OS               : Darwin
OS-release       : 21.3.0
Version          : Darwin Kernel Version 21.3.0: Wed Jan  5 21:37:58 PST 2022; root:xnu-8019.80.24~20/RELEASE_X86_64
machine          : x86_64
processor        : i386
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.1.1
numpy            : 1.19.1
pytz             : 2020.1
dateutil         : 2.8.1
pip              : 20.0.2
setuptools       : 46.4.0.post20200518
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.18.1
pandas_datareader: None
bs4              : None
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.2
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : 1.0.1
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.2
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : None
numba            : 0.51.2

## 2. Create an Example DataFrame

In [7]:
df = pd.DataFrame({'col_one':[1,2,3],'col_two':[4,5,6]})
df

   col_one  col_two
0        1        4
1        2        5
2        3        6

In [11]:
df = pd.DataFrame(np.random.rand(3,4))
df

          0         1         2         3
0  0.561631  0.293477  0.171604  0.655785
1  0.692932  0.112081  0.593933  0.601834
2  0.705493  0.040896  0.932212  0.659417

In [20]:
df = pd.DataFrame(np.random.rand(3,4),columns=list('abcd'))
df

          a         b         c         d
0  0.687046  0.174865  0.062715  0.613042
1  0.717530  0.709687  0.746902  0.164488
2  0.302543  0.061506  0.031534  0.216414

## 3. Rename Columns

In [46]:
df = pd.DataFrame({'col one': [1,2,3], 'col two': [4,5,6]})
df

   col one  col two
0        1        4
1        2        5
2        3        6

In [47]:
df.rename(columns={"col one": "col_one"},inplace=True) # can pick and choose what to rename
df

   col_one  col two
0        1        4
1        2        5
2        3        6

In [72]:
df.columns = ['col_one','col_two'] # have to rename all columns using this method
df

   col_one  col_two
0        1        4
1        2        5
2        3        6

In [48]:
df.columns.str.replace(' ', '_')

Index(['col_one', 'col_two'], dtype='object')

In [53]:
df.add_prefix('pre_')

   pre_col_one  pre_col two
0            1            4
1            2            5
2            3            6

In [54]:
df.add_suffix('_suffix')

   col_one_suffix  col two_suffix
0               1               4
1               2               5
2               3               6

## 4. Reverse Row Order

In [73]:
df.loc[::-1]

   col_one  col_two
2        3        6
1        2        5
0        1        4

In [74]:
df.loc[::-1].reset_index(drop=True) # start indexing at 0

   col_one  col_two
0        3        6
1        2        5
2        1        4

## 5. Reverse Column Order

In [78]:
df.loc[:,::-1]

   col_two  col_one
0        4        1
1        5        2
2        6        3

## 6. Select Column by DataType

In [81]:
df = pd.DataFrame({'col_1': [1,2,3], 'col_2':[4,5,6], 'col3': ['one','two','three']})
df

   col_1  col_2   col3
0      1      4    one
1      2      5    two
2      3      6  three

In [84]:
df.dtypes

col_1     int64
col_2     int64
col3     object
dtype: object

In [85]:
df.select_dtypes(include='int64')

   col_1  col_2
0      1      4
1      2      5
2      3      6

In [86]:
df.select_dtypes(exclude='int64')

    col3
0    one
1    two
2  three

## 7. Convert Strings to numbers

In [115]:
df = pd.DataFrame({'col1':['1','2','3'],
                  'col2': ['4','5','6'],
                  'col3': ['7','8','-']})
df

  col1 col2 col3
0    1    4    7
1    2    5    8
2    3    6    -

In [116]:
df.dtypes

col1    object
col2    object
col3    object
dtype: object

In [117]:
df.astype({'col1':'float', 'col2':'float'}).dtypes

col1    float64
col2    float64
col3     object
dtype: object

In [120]:
pd.to_numeric(df.col3,errors='coerce') # convert - to NaN

0    7.0
1    8.0
2    NaN
Name: col3, dtype: float64

In [121]:
pd.to_numeric(df.col3,errors='coerce').fillna(0)

0    7.0
1    8.0
2    0.0
Name: col3, dtype: float64

In [122]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col1  col2  col3
0     1     4   7.0
1     2     5   8.0
2     3     6   0.0

## Reduce DataFrame sizes

In [125]:
df = pd.read_csv('http://bit.ly/drinksbycountry')

df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [127]:
cols = ['beer_servings','continent']
small_drinks_df = pd.read_csv('http://bit.ly/drinksbycountry',usecols=cols)
small_drinks_df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [128]:
small_drinks_df.dtypes

beer_servings     int64
continent        object
dtype: object

In [129]:
dtypes = {'continent':'category'} # change to category datatype
small_drinks_df = pd.read_csv('http://bit.ly/drinksbycountry',usecols=cols,dtype=dtypes)
small_drinks_df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

## Build a DataFrame from multiple files (row-wise)

In [132]:
pd.read_csv('./data/stocks1.csv')

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [133]:
pd.read_csv('./data/stocks2.csv')

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [134]:
from glob import glob

In [135]:
stock_files = sorted(glob('data/stocks*.csv'))
stock_files

['data/stocks1.csv', 'data/stocks2.csv']

In [141]:
pd.concat(pd.read_csv(file) for file in stock_files)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [142]:
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO

## Build a DataFrame from multiple files (column wise)

In [143]:
pd.read_csv('./data/drinks1.csv')

         country  beer_servings  spirit_servings
0    Afghanistan              0                0
1        Albania             89              132
2        Algeria             25                0
3        Andorra            245              138
4         Angola            217               57
..           ...            ...              ...
188    Venezuela            333              100
189      Vietnam            111                2
190        Yemen              6                0
191       Zambia             32               19
192     Zimbabwe             64               18

[193 rows x 3 columns]

In [144]:
pd.read_csv('./data/drinks2.csv')

     wine_servings  total_litres_of_pure_alcohol      continent
0                0                           0.0           Asia
1               54                           4.9         Europe
2               14                           0.7         Africa
3              312                          12.4         Europe
4               45                           5.9         Africa
..             ...                           ...            ...
188              3                           7.7  South America
189              1                           2.0           Asia
190              0                           0.1           Asia
191              4                           2.5         Africa
192              4                           4.7         Africa

[193 rows x 3 columns]

In [147]:
drink_files = sorted(glob('./data/drinks*.csv'))
drink_files

['./data/drinks1.csv', './data/drinks2.csv']

In [148]:
pd.concat((pd.read_csv(file) for file in drink_files), axis='columns')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

## Create a DataFrame from the clipboard

In [152]:
df = pd.read_clipboard()
df

   wine_servings  total_litres_of_pure_alcohol continent
0              0                           0.0      Asia
1             54                           4.9    Europe
2             14                           0.7    Africa

In [153]:
df.dtypes

wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

## 12. Split a DataFrame into two random subsets